---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostError
source: html/20ac283b-8ded-d12a-ede5-1fa78e9a1227.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostError Property

Fabric Sheet is placed completely outside of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricSheetOutSideOfHostError { get; }
```